Documents/ПеремещениеНМА.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Document>
		<Properties>
			<Name>ПеремещениеНМА</Name>
			<Comment>(Общ)</Comment>
			<BasedOn>
				<xr:Item>Document.ИнвентаризацияНМА</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.МестонахождениеНМА</xr:Item>
				<xr:Item>InformationRegister.МестонахождениеНМАБухгалтерскийУчет</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПодразделениеОрганизации</Name>
					<Comment>(Регл)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МОЛОрганизации</Name>
					<Comment>(Регл)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПредседательКомиссии</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПервыйЧленКомиссии</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВторойЧленКомиссии</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТретийЧленКомиссии</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтражатьВБухгалтерскомУчете</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтражатьВУправленческомУчете</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Comment>(Упр)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>НематериальныеАктивы</Name>
					<Comment>(Общ)</Comment>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>НематериальныйАктив</Name>
							<Comment>(Общ)</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.НематериальныеАктивы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

InformationRegisters/МестонахождениеНМА.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<InformationRegister>
		<Properties>
			<Name>МестонахождениеНМА</Name>
			<Comment>(Упр)</Comment>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>МОЛ</Name>
					<Comment>Выбирается из списка регистра сведений Работники</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Местонахождение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>НематериальныйАктив</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НематериальныеАктивы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/МестонахождениеНМАБухгалтерскийУчет.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<InformationRegister>
		<Properties>
			<Name>МестонахождениеНМАБухгалтерскийУчет</Name>
			<Comment>(Регл)</Comment>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>МОЛ</Name>
					<Comment>Выбирается из списка регистра сведений "Работники организаций"</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Местонахождение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>НематериальныйАктив</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НематериальныеАктивы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Documents/ПеремещениеНМА/Ext/ObjectModule.bsl
Перем мУдалятьДвижения;

// Строки, хранят реквизиты имеющие смысл только для бух. учета и упр. соответственно
// в случае если документ не отражается в каком-то виде учета, делаются невидимыми

Перем мСтрокаРеквизитыБухУчета Экспорт; // (Регл)
Перем мСтрокаРеквизитыУпрУчета Экспорт; // (Упр)
Перем мСтрокаРеквизитыНалУчета Экспорт; // (Регл)

////////////////////////////////////////////////////////////////////////////////
// ЭКСПОРТНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ ДОКУМЕНТА

// Процедура заполняет структуры именами реквизитов, которые имеют смысл
// только для определенного вида учета
//
Процедура ЗаполнитьСписокРеквизитовЗависимыхОтТиповУчета() Экспорт

	мСтрокаРеквизитыБухУчета =  "ПодразделениеОрганизации,
								|МОЛОрганизации
								|";
	мСтрокаРеквизитыНалУчета = "";

КонецПроцедуры // ЗаполнитьСписокРеквизитовЗависимыхОтТиповУчета()

#Если Клиент Тогда

// Процедура осуществляет печать документа. Можно направить печать на 
// экран или принтер, а также распечатать необходмое количество копий.
//
//  Название макета печати передается в качестве параметра,
// по переданному названию находим имя макета в соответствии.
//
// Параметры:
//  НазваниеМакета - строка, название макета.
//
Процедура Печать(ИмяМакета, КоличествоЭкземпляров = 1, НаПринтер = Ложь, НепосредственнаяПечать = Ложь) Экспорт
	
	ТабДокумент = Неопределено;
	
	УниверсальныеМеханизмы.НапечататьДокумент(ТабДокумент, КоличествоЭкземпляров, НаПринтер, ОбщегоНазначения.СформироватьЗаголовокДокумента(ЭтотОбъект, НСтр("ru='Внутреннее перемещение нематериальных активов';uk='Внутрішнє переміщення нематеріальних активів'")), НепосредственнаяПечать);
	
КонецПроцедуры // Печать

// Возвращает доступные варианты печати документа
//
// Вовращаемое значение:
//  Струткура, каждая строка которой соответствует одному из вариантов печати
//  
Функция ПолучитьСтруктуруПечатныхФорм() Экспорт
	
	//Возврат Новый Структура("ОЗ1Сдача, ОЗ1Приемка",
	//						НСтр("ru='Форма ОЗ-1(сдача)';uk='Форма ОЗ-1(здавання)'"),
	//						НСтр("ru='Форма ОЗ-1(приемка)';uk='Форма ОЗ-1(прийняття)'"));
	Возврат Новый Структура;

КонецФункции // ПолучитьСтруктуруПечатныхФорм()

#КонецЕсли

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ДЛЯ ОБЕСПЕЧЕНИЯ ПРОВЕДЕНИЯ ДОКУМЕНТА

// Проверяет правильность заполнения шапки документа.
// Если какой-то из реквизтов шапки, влияющий на проведение не заполнен или
// заполнен не корректно, то выставляется флаг отказа в проведении.
// Проверяется также правильность заполнения реквизитов ссылочных полей документа.
// Проверка выполняется по объекту и по выборке из результата запроса по шапке.
//
// Параметры: 
//  СтруктураШапкиДокумента - выборка из результата запроса по шапке документа,
//  Отказ                   - флаг отказа в проведении,
//  Заголовок               - строка, заголовок сообщения об ошибке проведения.
//
Процедура ПроверитьЗаполнениеШапки(СтруктураШапкиДокумента, Отказ, Заголовок)

	// Укажем, что надо проверить:
	ОбязательныеРеквизитыШапки = "Организация, ПодразделениеОрганизации, МОЛОрганизации";

	СтруктураОбязательныхПолей = Новый Структура(ОбязательныеРеквизитыШапки);
	
	// Теперь позовем общую процедуру проверки.
	ЗаполнениеДокументов.ПроверитьЗаполнениеШапкиДокумента(ЭтотОбъект, СтруктураОбязательныхПолей, Отказ, Заголовок);

	Если ЗначениеЗаполнено(СтруктураШапкиДокумента.ПодразделениеОрганизации) 
		 И ЗначениеЗаполнено(СтруктураШапкиДокумента.Организация) 
		 И СтруктураШапкиДокумента.ПодразделениеОрганизации.Владелец <> СтруктураШапкиДокумента.Организация Тогда
		 
		ОбщегоНазначения.ОшибкаПриПроведении(НСтр("ru='Выбранное подразделение организации не соответствует указанной организации';uk='Обраний підрозділ організації не відповідає вказаній організації'"), Отказ,Заголовок);
		
	КонецЕсли;
	
КонецПроцедуры // ПроверитьЗаполнениеШапки()

// Процедура проверяет правильность заполнения реквизитов документа
//
Процедура ПроверкаРеквизитовТЧ(ТаблицаНМА,СтруктураШапкиДокумента,Отказ, Заголовок) Экспорт

	РеквизитыТабНМА = "НематериальныйАктив"; //через запятую
	ЗаполнениеДокументов.ПроверитьЗаполнениеТабличнойЧасти(ЭтотОбъект, "НематериальныеАктивы", Новый Структура(РеквизитыТабНМА), Отказ, Заголовок);

	// Проверим соответствие организаций НМА и организации документа

	Упр 	= СтруктураШапкиДокумента.ОтражатьВУправленческомУчете;
	Бухг 	= СтруктураШапкиДокумента.ОтражатьВБухгалтерскомУчете;
	
	//Проверка на наличие основных средств
	Запрос       = Новый Запрос;
	Запрос.УстановитьПараметр("ТекДата",        СтруктураШапкиДокумента.Дата);
	Запрос.УстановитьПараметр("СписокНМА",      ТаблицаНМА.ВыгрузитьКолонку("НематериальныйАктив"));
	Запрос.УстановитьПараметр("ТекОрганизация", СтруктураШапкиДокумента.Организация);
	Запрос.Текст = "ВЫБРАТЬ" + ?(Упр,"
	|	МестонахождениеНМА_УУ.НематериальныйАктив            КАК НМА_УУ", "") + ?(Бухг, ?(Упр, ",", "") + "
	|	МестонахождениеНМА_БУ.НематериальныйАктив КАК НМА_БУ", "") + "
	|ИЗ" + ?(Упр,"
	|	РегистрСведений.МестонахождениеНМА.СрезПоследних(&ТекДата, 
	|	                НематериальныйАктив В (&СписокНМА)
	|	                ) КАК МестонахождениеНМА_УУ", "") + ?(Упр и Бухг,"
	|		ПОЛНОЕ СОЕДИНЕНИЕ", "") + ?(Бухг,"
	|	РегистрСведений.МестонахождениеНМАБухгалтерскийУчет.СрезПоследних(&ТекДата, 
	|	                НематериальныйАктив В (&СписокНМА)
	|	                И Организация = &ТекОрганизация
	|	                ) КАК МестонахождениеНМА_БУ", "") + ?(Упр и Бухг,"
	|		ПО МестонахождениеНМА_УУ.НематериальныйАктив = МестонахождениеНМА_БУ.НематериальныйАктив", "");
    ТаблицаОстатков = Запрос.Выполнить().Выгрузить();
	
	ПроверитьЗаполнениеТЧУпр(СтруктураШапкиДокумента, ТаблицаНМА, ТаблицаОстатков, Отказ, Заголовок);
	ПроверитьЗаполнениеТЧРегл(СтруктураШапкиДокумента, ТаблицаНМА, ТаблицаОстатков, Отказ, Заголовок)

КонецПроцедуры // ПроверкаРеквизитов()

// Проверяет заполнение табличной части документа
//
Процедура ПроверитьЗаполнениеТЧУпр(СтруктураШапкиДокумента, ТаблицаПоНМА, ТаблицаОстатков, Отказ, Заголовок)
	
	Если НЕ СтруктураШапкиДокумента.ОтражатьВУправленческомУчете Тогда
		Возврат;
	КонецЕсли;
	
	//Проверка на наличие нематериальных активов
	Для каждого СтрокаТЧ Из ТаблицаПоНМА Цикл
		
		ТекНМА          = СтрокаТЧ.НематериальныйАктив;
		СтрокаОстатков = ТаблицаОстатков.Найти(ТекНМА, "НМА_УУ");
		
		Если СтрокаОстатков = Неопределено Тогда
			
			ОбщегоНазначения.ОшибкаПриПроведении(НСтр("ru='Строка ';uk='Рядок '") + СтрокаТЧ.НомерСтроки + "." + Символы.ПС + Символы.Таб
			                    + НСтр("ru='Упр.учет: По нематериальному активу ""';uk='Упр.облік: По нематеріальному активу ""'") + ТекНМА + НСтр("ru='"" нет записей до даты документа';uk='"" немає записів до дати документа'")
			                    + Символы.ПС + Символы.Таб + НСтр("ru='в регистре сведений ""Местонахождение НМА"".';uk='у регістрі відомостей ""Місцезнаходження НМА"".'")
			                    + Символы.ПС + Символы.Таб + НСтр("ru='Возможно оно еще не принято к управленческому учету.';uk='Можливо воно ще не прийнята до управлінського обліку.'"),
			                    Отказ, Заголовок);
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры // ПроверитьЗаполнениеТЧУпр

// Проверяет заполнение табличной части документа
//
Процедура ПроверитьЗаполнениеТЧРегл(СтруктураШапкиДокумента, ТаблицаПоНМА, ТаблицаОстатков, Отказ, Заголовок)

	Если (НЕ СтруктураШапкиДокумента.ОтражатьВБухгалтерскомУчете ) Тогда
		Возврат;
	КонецЕсли;
	
	ТекОрганизация =  СтруктураШапкиДокумента.Организация;
	
	//Проверка на наличие нематериальных активов
	Для каждого СтрокаТЧ Из ТаблицаПоНМА Цикл
		
		ТекНМА          = СтрокаТЧ.НематериальныйАктив;
		СтрокаОстатков = ТаблицаОстатков.Найти(ТекНМА, "НМА_БУ");
		
		Если СтрокаОстатков = Неопределено Тогда
			
			ОбщегоНазначения.ОшибкаПриПроведении(НСтр("ru='Строка ';uk='Рядок '") + СтрокаТЧ.НомерСтроки + "." + Символы.ПС + Символы.Таб
			                    + НСтр("ru='Бух.учет: Организация ""';uk='Бух.облік: Організація ""'") + ТекОрганизация + НСтр("ru='"". По нематериальному активу ""';uk='"". По нематеріальному активу ""'") + ТекНМА + НСтр("ru='"" нет записей до даты документа';uk='"" немає записів до дати документа'")
			                    + Символы.ПС + Символы.Таб + НСтр("ru='в регистре сведений ""Местонахождение НМА (бухгалтерский учет)"".';uk='у регістрі відомостей ""Місцезнаходження НМА (бухгалтерський облік)"".'")
			                    + Символы.ПС + Символы.Таб + НСтр("ru='Возможно оно еще не принято к бухгалтерскому учету.';uk='Можливо воно ще не прийнято до бухгалтерського обліку.'"),
			                    Отказ, Заголовок);
			
		КонецЕсли;
		
		
	КонецЦикла;
	
КонецПроцедуры // ПроверитьЗаполнениеТЧ

// Выполняет движения по регистрам 
//
Процедура ДвиженияПоРегистрам(СтруктураШапкиДокумента, ТаблицаПоНМА,Отказ, Заголовок)

	ДвиженияПоРегистрамУпр(СтруктураШапкиДокумента, ТаблицаПоНМА, Отказ, Заголовок);
	ДвиженияПоРегистрамРегл(СтруктураШапкиДокумента, ТаблицаПоНМА, Отказ, Заголовок);

КонецПроцедуры

Процедура ДвиженияПоРегистрамУпр(СтруктураШапкиДокумента, ТаблицаПоНМА, Отказ, Заголовок)
	
	Если НЕ СтруктураШапкиДокумента.ОтражатьВУправленческомУчете Тогда
		
		Возврат;
		
	КонецЕсли;
	
	ДатаДока = Дата;

	МестонахождениеНМА = Движения.МестонахождениеНМА;

	Для каждого СтрокаТЧ Из ТаблицаПоНМА Цикл
		
		Движение = МестонахождениеНМА.Добавить();
		Движение.Период           = ДатаДока;
		Движение.НематериальныйАктив = СтрокаТЧ.НематериальныйАктив;
		Движение.МОЛ              = СтруктураШапкиДокумента.МОЛОрганизации;
		Движение.Местонахождение  = СтруктураШапкиДокумента.Подразделение;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ДвиженияПоРегистрамРегл(СтруктураШапкиДокумента, ТаблицаПоНМА, Отказ, Заголовок)
	
	Если НЕ СтруктураШапкиДокумента.ОтражатьВБухгалтерскомУчете Тогда
		
		Возврат;
		
	КонецЕсли;
	
	ДатаДока = Дата;
	
	МестонахождениеНМАОрганизаций = Движения.МестонахождениеНМАБухгалтерскийУчет;
	
	Для каждого СтрокаТЧ Из ТаблицаПоНМА Цикл
		
		Движение = МестонахождениеНМАОрганизаций.Добавить();
		
		Движение.Период           		= ДатаДока;
		Движение.НематериальныйАктив 	= СтрокаТЧ.НематериальныйАктив;
		Движение.Организация      		= СтруктураШапкиДокумента.Организация;
		Движение.МОЛ              		= СтруктураШапкиДокумента.МОЛОрганизации;
		Движение.Местонахождение  		= СтруктураШапкиДокумента.ПодразделениеОрганизации;
		
	КонецЦикла;
	
КонецПроцедуры

// Процедура формирует структуру шапки документа и дополнительных полей.
//
Процедура ПодготовитьСтруктуруШапкиДокумента(Заголовок, СтруктураШапкиДокумента) Экспорт

	// Сформируем структуру реквизитов шапки документа
	СтруктураШапкиДокумента = ОбщегоНазначения.СформироватьСтруктуруШапкиДокумента(ЭтотОбъект);
	
КонецПроцедуры // ПодготовитьСтруктуруШапкиДокумента()

// Процедура формирует таблицы документа.
//
Процедура ПодготовитьТаблицыДокумента(СтруктураШапкиДокумента, ТаблицаПоНМА, Отказ, Заголовок) Экспорт
	
	СтруктураПолей = Новый Структура;
	СтруктураПолей.Вставить("НематериальныйАктив", "НематериальныйАктив");

	РезультатЗапросаПоНМА = ОбщегоНазначения.СформироватьЗапросПоТабличнойЧасти(ЭтотОбъект, "НематериальныеАктивы", СтруктураПолей);
	ТаблицаПоНМА          = РезультатЗапросаПоНМА.Выгрузить();
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ

// Обработчик события "ОбработкаПроведения" документа.
//
Процедура ОбработкаПроведения(Отказ)
	
	Перем Заголовок, СтруктураШапкиДокумента;
	Перем ТаблицаПоНМА;
	
	Если мУдалятьДвижения Тогда
    	ОбщегоНазначения.УдалитьДвиженияРегистратора(ЭтотОбъект, Отказ);
	КонецЕсли;
	
	ЗаполнитьСписокРеквизитовЗависимыхОтТиповУчета();

	// Сформируем структуру реквизитов шапки документа
	СтруктураШапкиДокумента = ОбщегоНазначения.СформироватьСтруктуруШапкиДокумента(ЭтотОбъект);
	
	Заголовок = ОбщегоНазначения.ПредставлениеДокументаПриПроведении(СтруктураШапкиДокумента);

	// Проверим правильность заполнения шапки документа
	ПроверитьЗаполнениеШапки(СтруктураШапкиДокумента, Отказ, Заголовок);

    ПодготовитьТаблицыДокумента(СтруктураШапкиДокумента, ТаблицаПоНМА, Отказ, Заголовок);
	
	ПроверкаРеквизитовТЧ(ТаблицаПоНМА, СтруктураШапкиДокумента,Отказ, Заголовок);
 	
	//проверка, нет ли списанных ОС в табличной части
	УправлениеВнеоборотнымиАктивами.ПроверитьНаСписанностьНМА(Дата, Организация, ТаблицаПоНМА, ОтражатьВУправленческомУчете, ОтражатьВБухгалтерскомУчете, Отказ, Заголовок);
	
    УправлениеВнеоборотнымиАктивами.ПроверитьДублированиеОСиНМАвТабличнойЧасти(НематериальныеАктивы, "НематериальныйАктив", НСтр("ru='Нематериальный актив';uk='Нематеріальний актив'"), Отказ, Заголовок);

	Если Не Отказ Тогда
		ДвиженияПоРегистрам(СтруктураШапкиДокумента, ТаблицаПоНМА,Отказ, Заголовок);
	КонецЕсли;

КонецПроцедуры // ОбработкаПроведения()

// Обработчик события "ОбработкаЗаполнения" документа.
//
Процедура ОбработкаЗаполнения(Основание)
	
	Если ТипЗнч(Основание) = Тип("ДокументСсылка.ИнвентаризацияНМА") Тогда
		
		ОтражатьВУправленческомУчете 	= Основание.ОтражатьВУправленческомУчете;
		ОтражатьВБухгалтерскомУчете 	= Основание.ОтражатьВБухгалтерскомУчете;
		ОтражатьВНалоговомУчете      	= Основание.ОтражатьВБухгалтерскомУчете;
		Организация              		= Основание.Организация;
		ПодразделениеОрганизации 		= Основание.ПодразделениеОрганизации;
		Подразделение 					= Основание.Подразделение;
		
		Для Каждого ТекСтрокаНМА Из Основание.НематериальныеАктивы Цикл
			
			Если (ТекСтрокаНМА.НаличиеПоДаннымУчета И НЕ ТекСтрокаНМА.НаличиеФактическое) 
				ИЛИ (ТекСтрокаНМА.НаличиеПоДаннымУчетаУУ И НЕ ТекСтрокаНМА.НаличиеФактическоеУУ) 
				Тогда
				
				НоваяСтрока = НематериальныеАктивы.Добавить();
				НоваяСтрока.НематериальныйАктив = ТекСтрокаНМА.НематериальныйАктив;
				
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры // ОбработкаЗаполнения()

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	мУдалятьДвижения = НЕ ЭтоНовый();
	
КонецПроцедуры

Процедура ОбработкаУдаленияПроведения(Отказ)
	
	ОбщегоНазначения.УдалитьДвиженияРегистратора(ЭтотОбъект, Отказ);
	
КонецПроцедуры
